Revit 2024 API
DividedSurface.CanBeDivided Method
 This returns true if the reference represents a face that can be used to create a divided surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool CanBeDivided(
	Document document,
	Reference reference
)
Visual Basic
Public Shared Function CanBeDivided ( _
	document As Document, _
	reference As Reference _
) As Boolean
Visual C++
public:
static bool CanBeDivided(
	Document^ document,
	Reference^ reference
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
reference
Type: Autodesk.Revit.DB.Reference
 The reference.
Return Value
 True if the reference can be used to create a divided surface, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DividedSurface Class
Autodesk.Revit.DB Namespace